# CurrentUnits Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisResultSchema..::..CurrentUnits Property
AnalysisResultSchema Class See Also
---
Stores the index in the array of applicable units
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int CurrentUnits { get; set; }
```

Visual Basic
---
```text
Public Property CurrentUnits As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int CurrentUnits {
	int get ();
	void set (int value);
}
```

# Remarks
Must be between 0 and (number of applicable units - 1)
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: currentUnits is not in the range from 0 to (number of applicable units - 1) |

# See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace